// DART OPERATORS
// ignore_for_file: unnecessary_type_check

void main() {
  // Арифметикалык операторлор
  /* 
    +	    Кошуу	Эки операндды кошоодо
    -	    Айырмаш	Эки операндды айырма
    -{expr}	Унар Минус	Абалдын аламын төмөндөрүү
    *	    Көбөйтүү	Эки операндды көбөйтүү
    /	    Бөлүү	Эки операндды бөлүү жана чыгуу double
    %	    Модуль	Бүтүн бөлүүдөн кийин калдык
    ~/	Бүтүн бөлүү	Эки операндды бөлүү жана чыгуу жаңыча бүтүн
  */

  int a = 1;
  int b = 2;
  print(a + b); // 3
  print(a - b); // -1
  print(a * b); // 2
  print(a / b); // 0.5
  print(6 % 2); // kaldygy 0 go narabar emes bolso 1 0 go barabar bolso 0
  print(8 ~/ 2); // sandy bolup, butun sanyn alyp beret
  print(-33); // maaninun aldyna `-` belgisin koisok ters kylyp beret

  // --------------------------------------------------------------------------------------

  // Көбөйтүү жана азайткан операторлор (Increment and Decrement Operators)
  /*
    ++var
    --var
    var++
    var--
  */
  double c = 20;
  double d = 30;
  print(++c); // 21
  print(--d); // 29
  print(c++); // 21
  print(d--); // 29
  // -------------------------------------------------------------------------------------

  // Дайындоо операторлору
  /*
  =	  Багыттоо	Булган маанини төмөндөрүүгө берүү
  +=	Кошуу	Булган мааниге көбөйтүү
  -=	Азайтуу	Булган мааниден кемситүү
  *=	Көбөйтүү	Булган мааниге көбөйтүү
  /=	Бөлүү	Булган мааниге бөлүү
  */

  double x = 34.0;
  var y = x;
  print(y); // 34

  // x = x + 10; -> 44
  print(x += 10); // 44
  print(x -= 10); // 34
  print(x -= 10); // 24

  // x = x*3; => 72
  print(x *= 3); // 72,
  print(x /= 2); // 36
  // -----------------------------------------------------------------------------------

  // Логикалык операторлор
  /*
    &&	Бул ‘жана’, бардык шарттар дүйнөгө түшүү true
    ||	Бул ‘же’. Бир нече шарт билим болсо түшүү true
    !	  Бул ‘эмес’. алдыңкы нөчүнчө дүйнө түшүү false жана алып келгендерди алдыңкы
  */

  int s = 23;
  int w = 32;
  print(s == 23 && w == 32); // true
  print(s == 12 && w == 32); // false
  print(s == 23 && w == 0); // false

  print(s == 23 || w == 32); // true
  print(s == 12 || w == 32); // true
  print(s == 23 || w == 0); // true
  print(s == 1 || w == 0); // false

  print(s != 23); // false
  print(s != 24); // true

  print(s > w); // false
  print(s < w); // true
  // --------------------------------------------------------------------------------

  // Түрдүн текшерүү операторлору
  /*
    is	is	Эгер объекттин определен типи бар болсо, true боюнча бул
    is!	is not	Эгер объекттин определен типи болсо, false боюнча бул
  */

  int f = 45;
  String n = 'Flutter';
  print(f is int); // true
  print(n is! String); // false
}
